dotnet.org
#+TITLE: .NET
#+SUBTITLE: NET is a developer platform with tools and libraries for building any type of app, including web, mobile, desktop, games, IoT, cloud, and microservices.
#+DATE: <2021-09-09 Sat>
#+AUTHOR: b-coimbra
#+EMAIL: me@metaphoric.dev
#+SETUPFILE: https://b-coimbra.github.io/org-scribbler-theme/scribbler.setup
#+EXPORT_FILE_NAME: docs/dotnet.html

* Intermediate Language (IL)

  Code exists on many levels.
  Abstraction is a ladder.
  At the highest levels of abstraction, we have C# code.
  At a lower level, we have an *intermediate language*.

  C# is compiled into that *intermediate language*.

* Async/await

  Notes from Brandon Minnick's [[https://www.youtube.com/watch?v=J0mcYVxJEl0][Correcting Common Async/Await mistakes in .NET]]

** ConfigureAwait(bool)

   By default, all statements marked as =await= have the =ConfigureAwait(true)= flag. By setting the value to =false=, we are explicitly saying that we do not wish to return back to the thread that called us.

   Instead, we find *any* available thread and assign the following tasks to it. This is what the *Context Switch* does.

   This is essential since we don't want to lock the main thread -- which is responsible for dealing with user interactions and the UI.

   #+begin_src csharp
     async Task GetAllPosts()
     {
         List<Posts> posts = await GetPosts().ConfigureAwait(false);

         foreach (var post in posts)
             Console.WriteLine(post.Name);
     }

     // thread 1: initializes the post variable
     // thread 1: encounters await, spawns new thread
     // thread 2: assigns a new thread to be executed after the current one finishes
     // thread 2: finishes to GetPosts(), calls thread 3
     // thread 3: continues with the instructions
   #+end_src

*** Why use it?

    *if we don't need to return back to the calling thread, use it.*

    We should use it /almost/ always. Unless we're dealing directly with the interface, we use it.

** Wait()

   *Never, ever use it.*

   It locks the calling thread until the current thread is done, which is not ideal.

   #+begin_src csharp
     async Task<List<Posts>> GetAllPosts()
     {
         List<Posts> posts = await GetAllPosts().Wait();

         if (posts == null || posts.Count() == 0)
             return new List<Posts>();

         return posts;
     }

     // thread 1: initializes the posts variables
     // thread 1: encounters the await keyword
     // thread 1: spawns another thread: thread 2
     // thread 2: locks the calling thread (thread 1) until GetAllPosts() is done
     // thread 2: finishes the GetAllPosts() operation, free thread 1
     // thread 1: continues with the instructions
   #+end_src

** Other tips

   - never use =async void=. When inside a =try/catch= block, the main thread just continues to execute.
   - never use =.Wait()= or =.Result()=
   - if synchronous, use =.GetAwaiter().GetResult()=
   - always use =async=

* EntityFramework
** One-to-many relationship

   Using the Generics lib:
   #+BEGIN_SRC csharp
     using System.Collections.Generic;
   #+END_SRC

   We can define a navigation property to store multiple entities (list):
   #+BEGIN_SRC csharp
     public virtual ICollection<Enrollment> Enrollments { get; set; }
   #+END_SRC

   It's defined as =virtual= so they can use the EntityFramework functionality, like slow loading.

* Destructor (Finalizers)

  Finalizers (destructors in general) are used to perform necessary clean-ups when a class instance is being collected by the garbage collector.

  #+BEGIN_SRC csharp
    class Car {
        ~Car { // finalizer
            // cleanup statements
        }
    }
  #+END_SRC

  A finalizer can also be defined as an expression body definition:

  #+BEGIN_SRC csharp
    public class Destroyer {
        ~Destroyer() => Console.WriteLine($"The {GetType().Name} destructor is executing.");
    }
  #+END_SRC

