docs/dotnet.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-14 ter 21:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>.NET</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="b-coimbra b-coimbra (Bruno Coimbra, index)" />
<link rel="stylesheet" type="text/css" href="https://b-coimbra.github.io/org-scribbler-theme/src/css/style.css" />
</head>
<body>
<div id="content">
<h1 class="title">.NET
<br />
<span class="subtitle">NET is a developer platform with tools and libraries for building any type of app, including web, mobile, desktop, games, IoT, cloud, and microservices.</span>
</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgbda47b6">Intermediate Language (IL)</a></li>
<li><a href="#orgcc4d687">Async/await</a>
<ul>
<li><a href="#orga70ad7b">ConfigureAwait(bool)</a></li>
<li><a href="#org76faf64">Why use it?</a></li>
<li><a href="#orgbcffb97">Wait()</a></li>
<li><a href="#org819083b">Other tips</a></li>
</ul>
</li>
<li><a href="#orgccf2b96">EntityFramework</a>
<ul>
<li><a href="#orgdf1b39b">One-to-many relationship</a></li>
</ul>
</li>
<li><a href="#org629bf46">Destructor (Finalizers)</a></li>
<li><a href="#org2732850">Dynamic Type</a></li>
<li><a href="#org38aa552">Extension Methods</a></li>
<li><a href="#org0770381">Global Assembly Cache (GAC)</a></li>
<li><a href="#org8f396d0">Interfaces</a></li>
<li><a href="#orged1a25b">Keywords</a>
<ul>
<li><a href="#org7524172">Structs</a></li>
<li><a href="#org075cdba">Parameters</a></li>
<li><a href="#org61cf7b6">ref</a></li>
<li><a href="#orge11b764">out</a></li>
<li><a href="#org2ddb53f">Named and Optional Parameters</a></li>
</ul>
</li>
<li><a href="#orge1bfbf8">Reflection</a>
<ul>
<li><a href="#org5b5a9b0">Get the members of a type</a></li>
<li><a href="#orgf931612">Get a method and invoke it</a></li>
<li><a href="#orgd80f2d9">Get Static Method and invoke it</a></li>
</ul>
</li>
<li><a href="#org7acdfc0">Stack and Heap</a>
<ul>
<li><a href="#org0d696ce">Stack</a></li>
<li><a href="#org3972f89">Heap</a></li>
</ul>
</li>
<li><a href="#orga4ce73b">Delegates</a></li>
<li><a href="#orgf495948">Threading</a>
<ul>
<li><a href="#orga42d370">Parallel.forEach loop</a></li>
</ul>
</li>
<li><a href="#orgd4152ed">StringBuilder</a>
<ul>
<li><a href="#org0852e56">Important Methods of StringBuilder</a></li>
<li><a href="#org72a4011">Examples</a></li>
</ul>
</li>
<li><a href="#orgde7ddb2">Null Coalescing</a>
<ul>
<li><a href="#org85aea37">Null conditional operator</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgbda47b6" class="outline-2">
<h2 id="orgbda47b6">Intermediate Language (IL)</h2>
<div class="outline-text-2" id="text-orgbda47b6">
<p>
Code exists on many levels.
Abstraction is a ladder.
At the highest levels of abstraction, we have C# code.
At a lower level, we have an <b>intermediate language</b>.
</p>

<p>
C# is compiled into that <b>intermediate language</b>.
</p>
</div>
</div>

<div id="outline-container-orgcc4d687" class="outline-2">
<h2 id="orgcc4d687">Async/await</h2>
<div class="outline-text-2" id="text-orgcc4d687">
<p>
Notes from Brandon Minnick's <a href="https://www.youtube.com/watch?v=J0mcYVxJEl0">Correcting Common Async/Await mistakes in .NET</a>
</p>
</div>

<div id="outline-container-orga70ad7b" class="outline-3">
<h3 id="orga70ad7b">ConfigureAwait(bool)</h3>
<div class="outline-text-3" id="text-orga70ad7b">
<p>
By default, all statements marked as <code>await</code> have the <code>ConfigureAwait(true)</code> flag. By setting the value to <code>false</code>, we are explicitly saying that we do not wish to return back to the thread that called us.
</p>

<p>
Instead, we find <b>any</b> available thread and assign the following tasks to it. This is what the <b>Context Switch</b> does.
</p>

<p>
This is essential since we don't want to lock the main thread &#x2013; which is responsible for dealing with user interactions and the UI.
</p>

<div class="org-src-container">
<pre class="src src-csharp"><span style="color: #b48ead; font-weight: bold;">async</span> <span style="color: #ECBE7B;">Task</span> <span style="color: #8FA1B3;">GetAllPosts</span>()
{
    <span style="color: #ECBE7B;">List</span>&lt;<span style="color: #ECBE7B;">Posts</span>&gt; <span style="color: #BF616A;">posts</span> = <span style="color: #b48ead; font-weight: bold;">await</span> <span style="color: #8FA1B3;">GetPosts</span>().<span style="color: #8FA1B3;">ConfigureAwait</span>(<span style="color: #D08770;">false</span>);

    <span style="color: #b48ead; font-weight: bold;">foreach</span> (<span style="color: #ECBE7B;">var</span> <span style="color: #BF616A;">post</span> <span style="color: #b48ead; font-weight: bold;">in</span> posts)
        Console.<span style="color: #8FA1B3;">WriteLine</span>(post.Name);
}

<span style="color: #65737E;">// </span><span style="color: #65737E;">thread 1: initializes the post variable</span>
<span style="color: #65737E;">// </span><span style="color: #65737E;">thread 1: encounters await, spawns new thread</span>
<span style="color: #65737E;">// </span><span style="color: #65737E;">thread 2: assigns a new thread to be executed after the current one finishes</span>
<span style="color: #65737E;">// </span><span style="color: #65737E;">thread 2: finishes to GetPosts(), calls thread 3</span>
<span style="color: #65737E;">// </span><span style="color: #65737E;">thread 3: continues with the instructions</span>
</pre>
</div>
</div>

<div id="outline-container-org76faf64" class="outline-3">
<h3 id="org76faf64">Why use it?</h3>
<div class="outline-text-3" id="text-org76faf64">
<p>
<b>if we don't need to return back to the calling thread, use it.</b>
</p>

<p>
We should use it <i>almost</i> always. Unless we're dealing directly with the interface, we use it.
</p>
</div>
</div>
</div>

<div id="outline-container-orgbcffb97" class="outline-3">
<h3 id="orgbcffb97">Wait()</h3>
<div class="outline-text-3" id="text-orgbcffb97">
<p>
<b>Never, ever use it.</b>
</p>

<p>
It locks the calling thread until the current thread is done, which is not ideal.
</p>

<div class="org-src-container">
<pre class="src src-csharp"><span style="color: #b48ead; font-weight: bold;">async</span> <span style="color: #ECBE7B;">Task</span>&lt;<span style="color: #ECBE7B;">List</span>&lt;<span style="color: #ECBE7B;">Posts</span>&gt;&gt; <span style="color: #8FA1B3;">GetAllPosts</span>()
{
    <span style="color: #ECBE7B;">List</span>&lt;<span style="color: #ECBE7B;">Posts</span>&gt; <span style="color: #BF616A;">posts</span> = <span style="color: #b48ead; font-weight: bold;">await</span> <span style="color: #8FA1B3;">GetAllPosts</span>().<span style="color: #8FA1B3;">Wait</span>();

    <span style="color: #b48ead; font-weight: bold;">if</span> (posts == <span style="color: #D08770;">null</span> || posts.<span style="color: #8FA1B3;">Count</span>() == 0)
        <span style="color: #b48ead; font-weight: bold;">return</span> <span style="color: #b48ead; font-weight: bold;">new</span> <span style="color: #ECBE7B;">List</span>&lt;<span style="color: #ECBE7B;">Posts</span>&gt;();

    <span style="color: #b48ead; font-weight: bold;">return</span> posts;
}

<span style="color: #65737E;">// </span><span style="color: #65737E;">thread 1: initializes the posts variables</span>
<span style="color: #65737E;">// </span><span style="color: #65737E;">thread 1: encounters the await keyword</span>
<span style="color: #65737E;">// </span><span style="color: #65737E;">thread 1: spawns another thread: thread 2</span>
<span style="color: #65737E;">// </span><span style="color: #65737E;">thread 2: locks the calling thread (thread 1) until GetAllPosts() is done</span>
<span style="color: #65737E;">// </span><span style="color: #65737E;">thread 2: finishes the GetAllPosts() operation, free thread 1</span>
<span style="color: #65737E;">// </span><span style="color: #65737E;">thread 1: continues with the instructions</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org819083b" class="outline-3">
<h3 id="org819083b">Other tips</h3>
<div class="outline-text-3" id="text-org819083b">
<ul class="org-ul">
<li>never use <code>async void</code>. When inside a <code>try/catch</code> block, the main thread just continues to execute.</li>
<li>never use <code>.Wait()</code> or <code>.Result()</code></li>
<li>if synchronous, use <code>.GetAwaiter().GetResult()</code></li>
<li>always use <code>async</code></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgccf2b96" class="outline-2">
<h2 id="orgccf2b96">EntityFramework</h2>
<div class="outline-text-2" id="text-orgccf2b96">
</div>
<div id="outline-container-orgdf1b39b" class="outline-3">
<h3 id="orgdf1b39b">One-to-many relationship</h3>
<div class="outline-text-3" id="text-orgdf1b39b">
<p>
Using the Generics lib:
</p>
<div class="org-src-container">
<pre class="src src-csharp"><span style="color: #b48ead; font-weight: bold;">using</span> <span style="color: #BF616A;">System</span>.<span style="color: #BF616A;">Collections</span>.<span style="color: #BF616A;">Generic</span>;
</pre>
</div>

<p>
We can define a navigation property to store multiple entities (list):
</p>
<div class="org-src-container">
<pre class="src src-csharp"><span style="color: #b48ead; font-weight: bold;">public</span> <span style="color: #b48ead; font-weight: bold;">virtual</span> <span style="color: #ECBE7B;">ICollection</span>&lt;<span style="color: #ECBE7B;">Enrollment</span>&gt; <span style="color: #BF616A;">Enrollments</span> { <span style="color: #b48ead; font-weight: bold;">get</span>; <span style="color: #b48ead; font-weight: bold;">set</span>; }
</pre>
</div>

<p>
It's defined as <code>virtual</code> so they can use the EntityFramework functionality, like slow loading.
</p>
</div>
</div>
</div>

<div id="outline-container-org629bf46" class="outline-2">
<h2 id="org629bf46">Destructor (Finalizers)</h2>
<div class="outline-text-2" id="text-org629bf46">
<p>
Finalizers (destructors in general) are used to perform necessary clean-ups when a class instance is being collected by the garbage collector.
</p>

<div class="org-src-container">
<pre class="src src-csharp"><span style="color: #b48ead; font-weight: bold;">class</span> <span style="color: #ECBE7B;">Car</span> {
    ~Car { <span style="color: #65737E;">// </span><span style="color: #65737E;">finalizer</span>
        <span style="color: #65737E;">// </span><span style="color: #65737E;">cleanup statements</span>
    }
}
</pre>
</div>

<p>
A finalizer can also be defined as an expression body definition:
</p>

<div class="org-src-container">
<pre class="src src-csharp"><span style="color: #b48ead; font-weight: bold;">public</span> <span style="color: #b48ead; font-weight: bold;">class</span> <span style="color: #ECBE7B;">Destroyer</span> {
    ~<span style="color: #8FA1B3;">Destroyer</span>() =&gt; Console.<span style="color: #8FA1B3;">WriteLine</span>($<span style="color: #A3BE8C;">"The {GetType().Name} destructor is executing."</span>);
}
</pre>
</div>
</div>
</div>
