docs/dotnet.html

<div id="outline-container-org2732850" class="outline-2">
<h2 id="org2732850">Dynamic Type</h2>
<div class="outline-text-2" id="text-org2732850">
<p>
<b>Dynamic binding defers <i>binding</i> - the process of resolving types, members, and operations
from compile time to runtime.</b>
</p>

<p>
Dynamic binding is useful when at compile time <i>you</i> know that a certain function, member, or operation
exists, but the <i>compiler</i> does not.
</p>

<div class="org-src-container">
<pre class="src src-csharp"><span style="color: #ECBE7B;">dynamic</span> <span style="color: #BF616A;">d</span> = <span style="color: #8FA1B3;">GetsomeObject</span>();
d.<span style="color: #8FA1B3;">Quack</span>();
</pre>
</div>

<p>
We expect the runtime type of <b>d</b> to have a <b>Quack</b> method. We just can't prove it statically.
Since <b>d</b> is <i>dynamic</i>, the compiler deferes binding <b>Quack</b> to <b>d</b> until runtime.
</p>
</div>
</div>

<div id="outline-container-org38aa552" class="outline-2">
<h2 id="org38aa552">Extension Methods</h2>
<div class="outline-text-2" id="text-org38aa552">
<p>
Extension methods allows for an existing type to be extended with new methods without altering
the definition of the original type.
</p>

<div class="org-src-container">
<pre class="src src-csharp"><span style="color: #b48ead; font-weight: bold;">public</span> <span style="color: #b48ead; font-weight: bold;">static</span> <span style="color: #b48ead; font-weight: bold;">class</span> <span style="color: #ECBE7B;">StringHelper</span>
{
    <span style="color: #b48ead; font-weight: bold;">public</span> <span style="color: #b48ead; font-weight: bold;">static</span> <span style="color: #ECBE7B;">void</span> <span style="color: #8FA1B3;">IsCapitalized</span>(<span style="color: #b48ead; font-weight: bold;">this</span> <span style="color: #ECBE7B;">string</span> <span style="color: #BF616A;">s</span>)
    {
        <span style="color: #b48ead; font-weight: bold;">if</span> (<span style="color: #ECBE7B;">string</span>.<span style="color: #8FA1B3;">IsNullOrEmpty</span>(<span style="color: #ECBE7B;">s</span>)) <span style="color: #b48ead; font-weight: bold;">return</span> <span style="color: #D08770;">false</span>;
        <span style="color: #b48ead; font-weight: bold;">return</span> <span style="color: #ECBE7B;">char</span>.<span style="color: #8FA1B3;">IsUpper</span>(<span style="color: #ECBE7B;">s</span>[0]);
    }
}

Console.<span style="color: #8FA1B3;">WriteLine</span>(<span style="color: #A3BE8C;">"Perth"</span>.<span style="color: #8FA1B3;">IsCapitalized</span>());
</pre>
</div>
</div>
</div>
<div id="outline-container-org0770381" class="outline-2">
<h2 id="org0770381">Global Assembly Cache (GAC)</h2>
<div class="outline-text-2" id="text-org0770381">
<p>
<code>global</code> applies to the entire machine
<code>assembly</code> what .NET calls its code-libraries (DLLs)
<code>cache</code> a place to store things for common/faster access
</p>

<p>
Basically, it's a way to keep DLLs globally accessible without worrying about conflicts.
Everything is located at <code>C:\\Windows\assembly</code>
</p>

<p>
So the GAC must be a place to store code libraries so they're accessible to all applications running on the machine.
</p>
</div>
</div>

<div id="outline-container-org8f396d0" class="outline-2">
<h2 id="org8f396d0">Interfaces</h2>
<div class="outline-text-2" id="text-org8f396d0">
<p>
Interfaces are "signatures" of an object, they include the behavior from multiple sources in a class.
</p>

<div class="org-src-container">
<pre class="src src-csharp"><span style="color: #b48ead; font-weight: bold;">interface</span> <span style="color: #ECBE7B;">IEquatable</span>&lt;<span style="color: #ECBE7B;">T</span>&gt;
{
    <span style="color: #ECBE7B;">bool</span> <span style="color: #8FA1B3;">Equals</span>(<span style="color: #ECBE7B;">T</span> <span style="color: #BF616A;">obj</span>);
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-csharp"><span style="color: #b48ead; font-weight: bold;">public</span> <span style="color: #b48ead; font-weight: bold;">class</span> <span style="color: #ECBE7B;">Car</span> : <span style="color: #ECBE7B;">IEquatable</span>&lt;<span style="color: #ECBE7B;">Car</span>&gt;
{
    <span style="color: #65737E;">// </span><span style="color: #65737E;">implementation of IEquatable&lt;T&gt; interface</span>
    <span style="color: #b48ead; font-weight: bold;">public</span> <span style="color: #ECBE7B;">bool</span> <span style="color: #8FA1B3;">Equals</span>(<span style="color: #ECBE7B;">Car</span> <span style="color: #BF616A;">car</span>)
    {
        <span style="color: #b48ead; font-weight: bold;">return</span> <span style="color: #D08770;">true</span>;
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orged1a25b" class="outline-2">
<h2 id="orged1a25b">Keywords</h2>
<div class="outline-text-2" id="text-orged1a25b">
</div>
<div id="outline-container-org7524172" class="outline-3">
<h3 id="org7524172">Structs</h3>
<div class="outline-text-3" id="text-org7524172">
<ol class="org-ol">
<li>Follows the same syntax as classes</li>
<li>Within a <code>struct</code> declaration, fields cannot be initialized unless they are declared as <code>const</code> or <code>static</code></li>
<li>A <code>struct</code> cannot declare a parameterless constructor</li>
<li>Unlike classes, <code>structs</code> can be initialized without using a <code>new</code> operator.</li>
<li>A <code>struct</code> cannot inherit from another <code>struct</code> or <code>class</code>.</li>
<li>A <code>struct</code> can implement interfaces</li>
<li>A <code>struct</code> cannot be null.</li>
</ol>

<div class="org-src-container">
<pre class="src src-csharp">
<span style="color: #b48ead; font-weight: bold;">public</span> <span style="color: #b48ead; font-weight: bold;">struct</span> <span style="color: #ECBE7B;">TestStruct</span> {
    <span style="color: #65737E;">// </span><span style="color: #65737E;">Fields, methods, properties and events ...</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org075cdba" class="outline-3">
<h3 id="org075cdba">Parameters</h3>
<div class="outline-text-3" id="text-org075cdba">
<div class="org-src-container">
<pre class="src src-csharp"><span style="color: #b48ead; font-weight: bold;">public</span> <span style="color: #b48ead; font-weight: bold;">class</span> <span style="color: #ECBE7B;">Keywords</span>
{
    <span style="color: #b48ead; font-weight: bold;">public</span> <span style="color: #b48ead; font-weight: bold;">static</span> <span style="color: #ECBE7B;">void</span> <span style="color: #8FA1B3;">Main</span>()
    {
        <span style="color: #ECBE7B;">int</span> <span style="color: #BF616A;">val1</span> = 0; <span style="color: #65737E;">// </span><span style="color: #65737E;">must be assigned a value;</span>
        <span style="color: #ECBE7B;">int</span> <span style="color: #BF616A;">val2</span>; <span style="color: #65737E;">// </span><span style="color: #65737E;">optional</span>

        <span style="color: #8FA1B3;">Keywords1</span>(<span style="color: #b48ead; font-weight: bold;">ref</span> <span style="color: #ECBE7B;">val1</span>);
        Console.<span style="color: #8FA1B3;">WriteLine</span>(<span style="color: #ECBE7B;">val1</span>);

        <span style="color: #8FA1B3;">Keywords2</span>(<span style="color: #b48ead; font-weight: bold;">out</span> <span style="color: #ECBE7B;">val2</span>);
        Console.<span style="color: #8FA1B3;">WriteLine</span>(<span style="color: #ECBE7B;">val2</span>);
    }

    <span style="color: #b48ead; font-weight: bold;">static</span> <span style="color: #ECBE7B;">void</span> <span style="color: #8FA1B3;">Keywords1</span>(<span style="color: #b48ead; font-weight: bold;">ref</span> <span style="color: #ECBE7B;">int</span> <span style="color: #D08770;">value</span>) =&gt; <span style="color: #D08770;">value</span> = 7;
    <span style="color: #b48ead; font-weight: bold;">static</span> <span style="color: #ECBE7B;">void</span> <span style="color: #8FA1B3;">Keywords2</span>(<span style="color: #b48ead; font-weight: bold;">out</span> <span style="color: #ECBE7B;">int</span> <span style="color: #D08770;">value</span>) =&gt; <span style="color: #D08770;">value</span> = 9; <span style="color: #65737E;">// </span><span style="color: #65737E;">must be defined</span>
}

<span style="color: #65737E;">/* </span><span style="color: #65737E;">Output</span>
<span style="color: #65737E;">   7</span>
<span style="color: #65737E;">   9</span>
<span style="color: #65737E;">*/</span>
</pre>
</div>
</div>

<div id="outline-container-org61cf7b6" class="outline-3">
<h3 id="org61cf7b6">ref</h3>
<div class="outline-text-3" id="text-org61cf7b6">
<p>
<code>Ref</code> keywords are used to pass an argument as a reference, meaning that when the value of that parameter
changes after being passed through the method, the new value is reflected in the new calling method.
</p>
</div>
</div>

<div id="outline-container-orge11b764" class="outline-3">
<h3 id="orge11b764">out</h3>
<div class="outline-text-3" id="text-orge11b764">
<p>
<code>Out</code> keywords is similar to <code>ref</code> in that, they are used to pass an argument, but they differ in that
arguments passed using <code>out</code> keyword can be passed without any value to be assigned to it.
</p>
</div>
</div>
</div>

<div id="outline-container-org2ddb53f" class="outline-3">
<h3 id="org2ddb53f">Named and Optional Parameters</h3>
<div class="outline-text-3" id="text-org2ddb53f">
<div class="org-src-container">
<pre class="src src-csharp"><span style="color: #65737E;">// </span><span style="color: #65737E;">optional arguments</span>
<span style="color: #b48ead; font-weight: bold;">public</span> <span style="color: #ECBE7B;">void</span> <span style="color: #8FA1B3;">ExampleMethod</span>(<span style="color: #ECBE7B;">int</span> <span style="color: #BF616A;">required</span>, <span style="color: #ECBE7B;">int</span> <span style="color: #BF616A;">optionalStr</span> = <span style="color: #A3BE8C;">"default string"</span>) { }

<span style="color: #b48ead; font-weight: bold;">static</span> <span style="color: #ECBE7B;">void</span> <span style="color: #8FA1B3;">Main</span>()
{
    <span style="color: #65737E;">// </span><span style="color: #65737E;">named arguments</span>
    <span style="color: #8FA1B3;">PrintOrderDetails</span>(sellerName: <span style="color: #A3BE8C;">"Gift Shop"</span>, 31, productName: <span style="color: #A3BE8C;">"Red Mug"</span>);
}

<span style="color: #b48ead; font-weight: bold;">static</span> <span style="color: #ECBE7B;">void</span> <span style="color: #8FA1B3;">PrintOrderDetails</span>(<span style="color: #ECBE7B;">string</span> <span style="color: #BF616A;">sellerName</span>, <span style="color: #ECBE7B;">int</span> <span style="color: #BF616A;">orderNum</span>, <span style="color: #ECBE7B;">string</span> <span style="color: #BF616A;">productName</span>) {}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orge1bfbf8" class="outline-2">
<h2 id="orge1bfbf8">Reflection</h2>
<div class="outline-text-2" id="text-orge1bfbf8">
<p>
Reflection is a C# language mechanism for accessing dynamic object properties in runtime.
Typically, reflection is used to fetch the information about dynamic object type and object attribute values.
</p>
</div>
