dotnet.org
** Get the members of a type

   #+BEGIN_SRC csharp
     using System;
     using System.Reflection;
     using System.Reflection.Linq;

     public class Program {
         public static void Main()
         {
             var members = typeof(object)
                 .GetMembers(Bindingflags.Public |
                             BindingFlags.Static |
                             BindingFlags.Instance);

             foreach (var member in members)
             {
                 bool inherited = member.DeclaringType.Equals(typeof(object).Name);
                 Console.WriteLine($"{member.Name} is a {member.MemberType}," +
                                   $"it has {(inherited ? "" : "not")} been inherited.");
             }
         }
     }
   #+END_SRC

** Get a method and invoke it

   #+BEGIN_SRC csharp
     using System;

     public class Program {
         public static void Main()
         {
             var theString = "hello";
             var method = theString
                 .GetType()
                 .GetMethod("Substring",
                            new [] { typeof(int), typeof(int) }); // the types of the method

             var result = method.Invoke(theString, new object[] { 0, 4 });
             Console.WriteLine(result);
         }
     }
   #+END_SRC

** Get Static Method and invoke it

   #+BEGIN_SRC csharp
     var method = typeof(Math).getMethod("Exp");
     var result = method.Invoke(null, new object[] { 2 }); // pass null as the first argument (no need for an instance)

     Console.WriteLine(result); // e^2
   #+END_SRC

* Stack and Heap

  The =stack= is responsible for keeping track on what's executing in our code.

  The =heap= is more or less responsible for keeping track of our objects (data).

  Essentially, we have four main things we'll be putting in the stack and heap as our code is executing:

  - Value types (~bool, byte, char, float, int~ etc)
  - Reference Types (~class, interface, [[*Delegates][delegate]], object, string~) -> HEAP
  - Pointers (reference to a type)
  - Instructions

** Stack

   Considering the following code:

   #+BEGIN_SRC csharp
     public int AddFive(int pValue)
     {
         int result;
         result = pValue + 5;
         return result;
     }
   #+END_SRC

   1. ~AddFive()~ and
   2. ~pValue | int~ goes into the stack.
   3. JIT compiles and executes the first instruction (=AddFive=).
   4. As the method executes, we need some memory for the =result= variable and it is allocated in the stack.
   5. The method finished the execution and the result is returned.
   6. All memory allocated on the stack is cleaned up by moving a pointer to the available memory address.

** Heap

   Value Types always go where they are declared,
   if a value type is declared outside a method, but inside a reference type it will be placed within
   the Reference Type of the heap.

   #+BEGIN_SRC csharp
     public class MyInt
     {
         public int MyValue;
     }

     public MyInt AddFive(int pValue)
     {
         MyInt result  new MyInt();
         result.Myvalue = pValue + 5;
         return result;
     }
   #+END_SRC

   1. Thread starts executing the method and its parameters are placed on the thread's stack.
   2. Because ~MyInt~ is a Reference Type, it is placed on the Heap and referenced by a Pointer on the Stack.
   3. After ~AddFive()~ is finished executing, we clean it up.
   4. We've left with an orphaned ~MyInt~ in the heap (there is no longer anyone in the stack pointing to ~MyInt~)

