docs/dotnet.html

<div id="outline-container-org5b5a9b0" class="outline-3">
<h3 id="org5b5a9b0">Get the members of a type</h3>
<div class="outline-text-3" id="text-org5b5a9b0">
<div class="org-src-container">
<pre class="src src-csharp"><span style="color: #b48ead; font-weight: bold;">using</span> <span style="color: #BF616A;">System</span>;
<span style="color: #b48ead; font-weight: bold;">using</span> <span style="color: #BF616A;">System</span>.<span style="color: #BF616A;">Reflection</span>;
<span style="color: #b48ead; font-weight: bold;">using</span> <span style="color: #BF616A;">System</span>.<span style="color: #BF616A;">Reflection</span>.<span style="color: #BF616A;">Linq</span>;

<span style="color: #b48ead; font-weight: bold;">public</span> <span style="color: #b48ead; font-weight: bold;">class</span> <span style="color: #ECBE7B;">Program</span> {
    <span style="color: #b48ead; font-weight: bold;">public</span> <span style="color: #b48ead; font-weight: bold;">static</span> <span style="color: #ECBE7B;">void</span> <span style="color: #8FA1B3;">Main</span>()
    {
        <span style="color: #ECBE7B;">var</span> <span style="color: #BF616A;">members</span> = <span style="color: #b48ead; font-weight: bold;">typeof</span>(<span style="color: #ECBE7B;">object</span>)
            .<span style="color: #8FA1B3;">GetMembers</span>(Bindingflags.Public |
                        BindingFlags.Static |
                        BindingFlags.Instance);

        <span style="color: #b48ead; font-weight: bold;">foreach</span> (<span style="color: #ECBE7B;">var</span> <span style="color: #BF616A;">member</span> <span style="color: #b48ead; font-weight: bold;">in</span> members)
        {
            <span style="color: #ECBE7B;">bool</span> <span style="color: #BF616A;">inherited</span> = member.DeclaringType.<span style="color: #8FA1B3;">Equals</span>(<span style="color: #b48ead; font-weight: bold;">typeof</span>(<span style="color: #ECBE7B;">object</span>).Name);
            Console.<span style="color: #8FA1B3;">WriteLine</span>($<span style="color: #A3BE8C;">"{member.Name} is a {member.MemberType},"</span> +
                              $<span style="color: #A3BE8C;">"it has {(inherited ? "" : "</span>not<span style="color: #A3BE8C;">")} been inherited."</span>);
        }
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf931612" class="outline-3">
<h3 id="orgf931612">Get a method and invoke it</h3>
<div class="outline-text-3" id="text-orgf931612">
<div class="org-src-container">
<pre class="src src-csharp"><span style="color: #b48ead; font-weight: bold;">using</span> <span style="color: #BF616A;">System</span>;

<span style="color: #b48ead; font-weight: bold;">public</span> <span style="color: #b48ead; font-weight: bold;">class</span> <span style="color: #ECBE7B;">Program</span> {
    <span style="color: #b48ead; font-weight: bold;">public</span> <span style="color: #b48ead; font-weight: bold;">static</span> <span style="color: #ECBE7B;">void</span> <span style="color: #8FA1B3;">Main</span>()
    {
        <span style="color: #ECBE7B;">var</span> <span style="color: #BF616A;">theString</span> = <span style="color: #A3BE8C;">"hello"</span>;
        <span style="color: #ECBE7B;">var</span> <span style="color: #BF616A;">method</span> = theString
            .<span style="color: #8FA1B3;">GetType</span>()
            .<span style="color: #8FA1B3;">GetMethod</span>(<span style="color: #A3BE8C;">"Substring"</span>,
                       <span style="color: #b48ead; font-weight: bold;">new</span> [] { <span style="color: #b48ead; font-weight: bold;">typeof</span>(<span style="color: #ECBE7B;">int</span>), <span style="color: #b48ead; font-weight: bold;">typeof</span>(<span style="color: #ECBE7B;">int</span>) }); <span style="color: #65737E;">// </span><span style="color: #65737E;">the types of the method</span>

        <span style="color: #ECBE7B;">var</span> <span style="color: #BF616A;">result</span> = method.<span style="color: #8FA1B3;">Invoke</span>(<span style="color: #ECBE7B;">theString</span>, <span style="color: #b48ead; font-weight: bold;">new</span> <span style="color: #ECBE7B;">object</span>[] { 0, 4 });
        Console.<span style="color: #8FA1B3;">WriteLine</span>(<span style="color: #ECBE7B;">result</span>);
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd80f2d9" class="outline-3">
<h3 id="orgd80f2d9">Get Static Method and invoke it</h3>
<div class="outline-text-3" id="text-orgd80f2d9">
<div class="org-src-container">
<pre class="src src-csharp"><span style="color: #ECBE7B;">var</span> <span style="color: #BF616A;">method</span> = <span style="color: #b48ead; font-weight: bold;">typeof</span>(Math).<span style="color: #8FA1B3;">getMethod</span>(<span style="color: #A3BE8C;">"Exp"</span>);
<span style="color: #ECBE7B;">var</span> <span style="color: #BF616A;">result</span> = method.<span style="color: #8FA1B3;">Invoke</span>(<span style="color: #D08770;">null</span>, <span style="color: #b48ead; font-weight: bold;">new</span> <span style="color: #ECBE7B;">object</span>[] { 2 }); <span style="color: #65737E;">// </span><span style="color: #65737E;">pass null as the first argument (no need for an instance)</span>

Console.<span style="color: #8FA1B3;">WriteLine</span>(result); <span style="color: #65737E;">// </span><span style="color: #65737E;">e^2</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org7acdfc0" class="outline-2">
<h2 id="org7acdfc0">Stack and Heap</h2>
<div class="outline-text-2" id="text-org7acdfc0">
<p>
The <code>stack</code> is responsible for keeping track on what's executing in our code.
</p>

<p>
The <code>heap</code> is more or less responsible for keeping track of our objects (data).
</p>

<p>
Essentially, we have four main things we'll be putting in the stack and heap as our code is executing:
</p>

<ul class="org-ul">
<li>Value types (<code>bool, byte, char, float, int</code> etc)</li>
<li>Reference Types (<code>class, interface, [[*Delegates][delegate]], object, string</code>) -&gt; HEAP</li>
<li>Pointers (reference to a type)</li>
<li>Instructions</li>
</ul>
</div>

<div id="outline-container-org0d696ce" class="outline-3">
<h3 id="org0d696ce">Stack</h3>
<div class="outline-text-3" id="text-org0d696ce">
<p>
Considering the following code:
</p>

<div class="org-src-container">
<pre class="src src-csharp"><span style="color: #b48ead; font-weight: bold;">public</span> <span style="color: #ECBE7B;">int</span> <span style="color: #8FA1B3;">AddFive</span>(<span style="color: #ECBE7B;">int</span> <span style="color: #BF616A;">pValue</span>)
{
    <span style="color: #ECBE7B;">int</span> <span style="color: #BF616A;">result</span>;
    result = pValue + 5;
    <span style="color: #b48ead; font-weight: bold;">return</span> result;
}
</pre>
</div>

<ol class="org-ol">
<li><code>AddFive()</code> and</li>
<li><code>pValue | int</code> goes into the stack.</li>
<li>JIT compiles and executes the first instruction (<code>AddFive</code>).</li>
<li>As the method executes, we need some memory for the <code>result</code> variable and it is allocated in the stack.</li>
<li>The method finished the execution and the result is returned.</li>
<li>All memory allocated on the stack is cleaned up by moving a pointer to the available memory address.</li>
</ol>
</div>
</div>

<div id="outline-container-org3972f89" class="outline-3">
<h3 id="org3972f89">Heap</h3>
<div class="outline-text-3" id="text-org3972f89">
<p>
Value Types always go where they are declared,
if a value type is declared outside a method, but inside a reference type it will be placed within
the Reference Type of the heap.
</p>

<div class="org-src-container">
<pre class="src src-csharp"><span style="color: #b48ead; font-weight: bold;">public</span> <span style="color: #b48ead; font-weight: bold;">class</span> <span style="color: #ECBE7B;">MyInt</span>
{
    <span style="color: #b48ead; font-weight: bold;">public</span> <span style="color: #ECBE7B;">int</span> <span style="color: #BF616A;">MyValue</span>;
}

<span style="color: #b48ead; font-weight: bold;">public</span> <span style="color: #ECBE7B;">MyInt</span> <span style="color: #8FA1B3;">AddFive</span>(<span style="color: #ECBE7B;">int</span> <span style="color: #BF616A;">pValue</span>)
{
    MyInt <span style="color: #ECBE7B;">result</span>  <span style="color: #b48ead; font-weight: bold;">new</span> <span style="color: #ECBE7B;">MyInt</span>();
    result.Myvalue = pValue + 5;
    <span style="color: #b48ead; font-weight: bold;">return</span> result;
}
</pre>
</div>

<ol class="org-ol">
<li>Thread starts executing the method and its parameters are placed on the thread's stack.</li>
<li>Because <code>MyInt</code> is a Reference Type, it is placed on the Heap and referenced by a Pointer on the Stack.</li>
<li>After <code>AddFive()</code> is finished executing, we clean it up.</li>
<li>We've left with an orphaned <code>MyInt</code> in the heap (there is no longer anyone in the stack pointing to <code>MyInt</code>)</li>
</ol>
</div>
</div>
</div>
