dotnet.org
* Delegates

    Delegates are types that represent a reference to a method.
    They are used for passing arguments as reference to other methods.

    #+BEGIN_SRC csharp
      class DelegateExample {
          public void Run()
          {
              // using class method
              InvokeDelegate(WriteToConsole);

              // using anonymous method
              DelegateInvoker di = delegate (string input)
                  {
                      Console.WriteLine(string.Format("di: {0}", input));
                      return true;
                  }

              InvokeDelegate(di);

              // using lambda expression;
              InvokeDelegate(input => true);
          }

          public delegate bool DelegateInvoker(string input);

          public void InvokeDelegate(DelegateInvoker func)
          {
              var ret = func("Hello world");
              Console.WriteLine("> Delegate returned {ret}");
          }

          public bool WriteToConsole(string input)
          {
              Console.WriteLine($"WriteToConsole: {input}");
              return true;
          }
      }
    #+END_SRC

* Threading

  Creating and starting a second thread:

  #+BEGIN_SRC csharp
    using System;
    using System.Threading;

    class Program {
        static void Main()
        {
            var thread = new Thread(Secondary);
            thread.Start();
        }

        static void Secondary() => Console.WriteLine("Hello world");
    }
  #+END_SRC

** Parallel.forEach loop

   When the order of the output is not important, we can apply multiple threads to a foreach loop:

   #+BEGIN_SRC csharp
     using System;
     using System.Threading;
     using System.Threading.Tasks;

     public class Program {
         public static void Main() {
             int[] Numbers = new int[] { 1, 2, 3, 4, 5, 6, 7, 8, 9 };

             // single-threaded:
             Console.WriteLine("Normal foreach loop: ");

             foreach (var number in Numbers)
                 Console.WriteLine(longCalculation(number));

             // This is the Parallel (Multi-threaded solution):
             Console.WriteLine("Multiple threads: ");
             Parallel.forEach(Numbers, number =>
                              Console.WriteLine(longCalculation(number));
             );
         }

         private static int longCalculation(int number)
         {
             Thread.Sleep(1000); // sleep to simulate a long calculation
             return number * number;
         }
     }
   #+END_SRC
* StringBuilder

  A String is immutable, meaning String cannot be changed once created.

  #+BEGIN_SRC csharp
    StringBuilder sb = new StringBuilder();

    // or

    StringBuilder sb = new StringBuilder("Hello world!!");

    // allocate 50 bytes sequentially onto the memory heap.
    StringBuilder sb = new StringBuilder("Hello world", 50);
  #+END_SRC

** Important Methods of StringBuilder

   | Method Name                                   | Description                                                        |
   |-----------------------------------------------+--------------------------------------------------------------------|
   | =StringBuilder.Append(valueToAppend)=         | Appends the passed values to the end of the current String         |
   | =StringBuilder.AppendFormat()=                | Replaces a format specifier passed in a string with formatted text |
   | =StringBuilder.Insert(index, value)=          | Inserts a string at the specified index of the current object      |
   | =StringBuilder.Remove(int start, int length)= | Removes the specified number of characters from the given position |
   | =StringBuilder.Replace(old, new)=             | Replaces characters with new characters                            |

*** Examples

**** Append

     #+BEGIN_SRC csharp
       StringBuilder sb = new StringBuilder("hello", 50);

       sb.Append("World!");
       sb.AppendLine("Hello C#");
       sb.AppendLine("This is a new line.");

       Console.WriteLine(sb);
     #+END_SRC

**** AppendFormat

     #+BEGIN_SRC csharp
       StringBuilder sb = new StringBuilder("Hello world", 50);
       sb.Insert(5, " C#");

       Console.WriteLine(sb);
     #+END_SRC

