docs/dotnet.html

<div id="outline-container-orga4ce73b" class="outline-2">
<h2 id="orga4ce73b">Delegates</h2>
<div class="outline-text-2" id="text-orga4ce73b">
<p>
Delegates are types that represent a reference to a method.
They are used for passing arguments as reference to other methods.
</p>

<div class="org-src-container">
<pre class="src src-csharp"><span style="color: #b48ead; font-weight: bold;">class</span> <span style="color: #ECBE7B;">DelegateExample</span> {
    <span style="color: #b48ead; font-weight: bold;">public</span> <span style="color: #ECBE7B;">void</span> <span style="color: #8FA1B3;">Run</span>()
    {
        <span style="color: #65737E;">// </span><span style="color: #65737E;">using class method</span>
        <span style="color: #8FA1B3;">InvokeDelegate</span>(<span style="color: #ECBE7B;">WriteToConsole</span>);

        <span style="color: #65737E;">// </span><span style="color: #65737E;">using anonymous method</span>
        <span style="color: #ECBE7B;">DelegateInvoker</span> <span style="color: #BF616A;">di</span> = <span style="color: #b48ead; font-weight: bold;">delegate</span> (<span style="color: #ECBE7B;">string</span> <span style="color: #BF616A;">input</span>)
            {
                Console.<span style="color: #8FA1B3;">WriteLine</span>(<span style="color: #ECBE7B;">string</span>.<span style="color: #8FA1B3;">Format</span>(<span style="color: #A3BE8C;">"di: {0}"</span>, <span style="color: #ECBE7B;">input</span>));
                <span style="color: #b48ead; font-weight: bold;">return</span> <span style="color: #D08770;">true</span>;
            }

        <span style="color: #8FA1B3;">InvokeDelegate</span>(<span style="color: #ECBE7B;">di</span>);

        <span style="color: #65737E;">// </span><span style="color: #65737E;">using lambda expression;</span>
        <span style="color: #8FA1B3;">InvokeDelegate</span>(input =&gt; <span style="color: #D08770;">true</span>);
    }

    <span style="color: #b48ead; font-weight: bold;">public</span> <span style="color: #b48ead; font-weight: bold;">delegate</span> <span style="color: #ECBE7B;">bool</span> <span style="color: #8FA1B3;">DelegateInvoker</span>(<span style="color: #ECBE7B;">string</span> <span style="color: #BF616A;">input</span>);

    <span style="color: #b48ead; font-weight: bold;">public</span> <span style="color: #ECBE7B;">void</span> <span style="color: #8FA1B3;">InvokeDelegate</span>(<span style="color: #ECBE7B;">DelegateInvoker</span> <span style="color: #BF616A;">func</span>)
    {
        <span style="color: #ECBE7B;">var</span> <span style="color: #BF616A;">ret</span> = <span style="color: #8FA1B3;">func</span>(<span style="color: #A3BE8C;">"Hello world"</span>);
        Console.<span style="color: #8FA1B3;">WriteLine</span>(<span style="color: #A3BE8C;">"&gt; Delegate returned {ret}"</span>);
    }

    <span style="color: #b48ead; font-weight: bold;">public</span> <span style="color: #ECBE7B;">bool</span> <span style="color: #8FA1B3;">WriteToConsole</span>(<span style="color: #ECBE7B;">string</span> <span style="color: #BF616A;">input</span>)
    {
        Console.<span style="color: #8FA1B3;">WriteLine</span>($<span style="color: #A3BE8C;">"WriteToConsole: {input}"</span>);
        <span style="color: #b48ead; font-weight: bold;">return</span> <span style="color: #D08770;">true</span>;
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf495948" class="outline-2">
<h2 id="orgf495948">Threading</h2>
<div class="outline-text-2" id="text-orgf495948">
<p>
Creating and starting a second thread:
</p>

<div class="org-src-container">
<pre class="src src-csharp"><span style="color: #b48ead; font-weight: bold;">using</span> <span style="color: #BF616A;">System</span>;
<span style="color: #b48ead; font-weight: bold;">using</span> <span style="color: #BF616A;">System</span>.<span style="color: #BF616A;">Threading</span>;

<span style="color: #b48ead; font-weight: bold;">class</span> <span style="color: #ECBE7B;">Program</span> {
    <span style="color: #b48ead; font-weight: bold;">static</span> <span style="color: #ECBE7B;">void</span> <span style="color: #8FA1B3;">Main</span>()
    {
        <span style="color: #ECBE7B;">var</span> <span style="color: #BF616A;">thread</span> = <span style="color: #b48ead; font-weight: bold;">new</span> <span style="color: #ECBE7B;">Thread</span>(<span style="color: #ECBE7B;">Secondary</span>);
        thread.<span style="color: #8FA1B3;">Start</span>();
    }

    <span style="color: #b48ead; font-weight: bold;">static</span> <span style="color: #ECBE7B;">void</span> <span style="color: #8FA1B3;">Secondary</span>() =&gt; Console.<span style="color: #8FA1B3;">WriteLine</span>(<span style="color: #A3BE8C;">"Hello world"</span>);
}
</pre>
</div>
</div>

<div id="outline-container-orga42d370" class="outline-3">
<h3 id="orga42d370">Parallel.forEach loop</h3>
<div class="outline-text-3" id="text-orga42d370">
<p>
When the order of the output is not important, we can apply multiple threads to a foreach loop:
</p>

<div class="org-src-container">
<pre class="src src-csharp"><span style="color: #b48ead; font-weight: bold;">using</span> <span style="color: #BF616A;">System</span>;
<span style="color: #b48ead; font-weight: bold;">using</span> <span style="color: #BF616A;">System</span>.<span style="color: #BF616A;">Threading</span>;
<span style="color: #b48ead; font-weight: bold;">using</span> <span style="color: #BF616A;">System</span>.<span style="color: #BF616A;">Threading</span>.<span style="color: #BF616A;">Tasks</span>;

<span style="color: #b48ead; font-weight: bold;">public</span> <span style="color: #b48ead; font-weight: bold;">class</span> <span style="color: #ECBE7B;">Program</span> {
    <span style="color: #b48ead; font-weight: bold;">public</span> <span style="color: #b48ead; font-weight: bold;">static</span> <span style="color: #ECBE7B;">void</span> <span style="color: #8FA1B3;">Main</span>() {
        <span style="color: #ECBE7B;">int</span>[] <span style="color: #BF616A;">Numbers</span> = <span style="color: #b48ead; font-weight: bold;">new</span> <span style="color: #ECBE7B;">int</span>[] { 1, 2, 3, 4, 5, 6, 7, 8, 9 };

        <span style="color: #65737E;">// </span><span style="color: #65737E;">single-threaded:</span>
        Console.<span style="color: #8FA1B3;">WriteLine</span>(<span style="color: #A3BE8C;">"Normal foreach loop: "</span>);

        <span style="color: #b48ead; font-weight: bold;">foreach</span> (<span style="color: #ECBE7B;">var</span> <span style="color: #BF616A;">number</span> <span style="color: #b48ead; font-weight: bold;">in</span> Numbers)
            Console.<span style="color: #8FA1B3;">WriteLine</span>(<span style="color: #8FA1B3;">longCalculation</span>(<span style="color: #ECBE7B;">number</span>));

        <span style="color: #65737E;">// </span><span style="color: #65737E;">This is the Parallel (Multi-threaded solution):</span>
        Console.<span style="color: #8FA1B3;">WriteLine</span>(<span style="color: #A3BE8C;">"Multiple threads: "</span>);
        Parallel.<span style="color: #8FA1B3;">forEach</span>(<span style="color: #ECBE7B;">Numbers</span>, number =&gt;
                         Console.<span style="color: #8FA1B3;">WriteLine</span>(<span style="color: #8FA1B3;">longCalculation</span>(<span style="color: #ECBE7B;">number</span>));
        );
    }

    <span style="color: #b48ead; font-weight: bold;">private</span> <span style="color: #b48ead; font-weight: bold;">static</span> <span style="color: #ECBE7B;">int</span> <span style="color: #8FA1B3;">longCalculation</span>(<span style="color: #ECBE7B;">int</span> <span style="color: #BF616A;">number</span>)
    {
        Thread.<span style="color: #8FA1B3;">Sleep</span>(1000); <span style="color: #65737E;">// </span><span style="color: #65737E;">sleep to simulate a long calculation</span>
        <span style="color: #b48ead; font-weight: bold;">return</span> number * number;
    }
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgd4152ed" class="outline-2">
<h2 id="orgd4152ed">StringBuilder</h2>
<div class="outline-text-2" id="text-orgd4152ed">
<p>
A String is immutable, meaning String cannot be changed once created.
</p>

<div class="org-src-container">
<pre class="src src-csharp"><span style="color: #ECBE7B;">StringBuilder</span> <span style="color: #BF616A;">sb</span> = <span style="color: #b48ead; font-weight: bold;">new</span> <span style="color: #ECBE7B;">StringBuilder</span>();

<span style="color: #65737E;">// </span><span style="color: #65737E;">or</span>

<span style="color: #ECBE7B;">StringBuilder</span> <span style="color: #BF616A;">sb</span> = <span style="color: #b48ead; font-weight: bold;">new</span> <span style="color: #ECBE7B;">StringBuilder</span>(<span style="color: #A3BE8C;">"Hello world!!"</span>);

<span style="color: #65737E;">// </span><span style="color: #65737E;">allocate 50 bytes sequentially onto the memory heap.</span>
<span style="color: #ECBE7B;">StringBuilder</span> <span style="color: #BF616A;">sb</span> = <span style="color: #b48ead; font-weight: bold;">new</span> <span style="color: #ECBE7B;">StringBuilder</span>(<span style="color: #A3BE8C;">"Hello world"</span>, 50);
</pre>
</div>
</div>

<div id="outline-container-org0852e56" class="outline-3">
<h3 id="org0852e56">Important Methods of StringBuilder</h3>
<div class="outline-text-3" id="text-org0852e56">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Method Name</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>StringBuilder.Append(valueToAppend)</code></td>
<td class="org-left">Appends the passed values to the end of the current String</td>
</tr>

<tr>
<td class="org-left"><code>StringBuilder.AppendFormat()</code></td>
<td class="org-left">Replaces a format specifier passed in a string with formatted text</td>
</tr>

<tr>
<td class="org-left"><code>StringBuilder.Insert(index, value)</code></td>
<td class="org-left">Inserts a string at the specified index of the current object</td>
</tr>

<tr>
<td class="org-left"><code>StringBuilder.Remove(int start, int length)</code></td>
<td class="org-left">Removes the specified number of characters from the given position</td>
</tr>

<tr>
<td class="org-left"><code>StringBuilder.Replace(old, new)</code></td>
<td class="org-left">Replaces characters with new characters</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-org72a4011" class="outline-3">
<h3 id="org72a4011">Examples</h3>
<div class="outline-text-3" id="text-org72a4011">
</div>
<div id="outline-container-orgf97a7d1" class="outline-4">
<h4 id="orgf97a7d1">Append</h4>
<div class="outline-text-4" id="text-orgf97a7d1">
<div class="org-src-container">
<pre class="src src-csharp"><span style="color: #ECBE7B;">StringBuilder</span> <span style="color: #BF616A;">sb</span> = <span style="color: #b48ead; font-weight: bold;">new</span> <span style="color: #ECBE7B;">StringBuilder</span>(<span style="color: #A3BE8C;">"hello"</span>, 50);

sb.<span style="color: #8FA1B3;">Append</span>(<span style="color: #A3BE8C;">"World!"</span>);
sb.<span style="color: #8FA1B3;">AppendLine</span>(<span style="color: #A3BE8C;">"Hello C#"</span>);
sb.<span style="color: #8FA1B3;">AppendLine</span>(<span style="color: #A3BE8C;">"This is a new line."</span>);

Console.<span style="color: #8FA1B3;">WriteLine</span>(sb);
</pre>
</div>
</div>
</div>
